waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/Device/Include/fm33fk5xx.h
/**************************************************************************************************** * @file     FM33FKXX.h
 *
 * @brief    CMSIS CORTEX-M0 Peripheral Access Layer Header File for
 *           FM33FKXX from Keil.
 *
 * @version  V0.0.1
 * @date     23 march 2023
 *
 * @note     Generated with SVDConv V2.87e 
 *           from CMSIS SVD File 'FM33FKXX.SVD' Version 1.0,
 *
 * @par      ARM Limited (ARM) is supplying this software for use with Cortex-M
 *           processor based microcontroller, but can be equally used for other
 *           suitable processor architectures. This file can be freely distributed.
 *           Modifications to this file shall be clearly marked.
 *
 *           THIS SOFTWARE IS PROVIDED “AS IS”. NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 *           OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 *           MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 *           ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 *           CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 *******************************************************************************************************/


/** @addtogroup Keil
  * @{
  */

/** @addtogroup FM33FKXX
  * @{
  */

#ifndef FM33FK5XX_H
#define FM33FK5XX_H

#ifdef __cplusplus
extern "C" {
#endif

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;
typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunState;
typedef enum {FAIL = 0, PASS = !FAIL} ErrorStatus;

#define __RCHF_INITIAL_CLOCK        (8000000)        /* Value of the Internal RC HIGH oscillator in Hz */
#define __RCMF_CLOCK                (4000000)        /* Value of the Internal RC 4M oscillator in Hz */
#define __LPOSC_CLOCK               (32000)          /* Value of the Internal RC LOW oscillator in Hz */
#define __XTHF_CLOCK                (8000000)        /* Value of the EXTERNAL oscillator in Hz */
#define __XTLF_CLOCK                (32768)          /* Value of the EXTERNAL oscillator in Hz */


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {

/* -------------------  FM33FKXX Processor Exceptions Numbers  -------------------*/
  NMI_IRQn                      = -14,              /*!<   2  不可屏蔽中断 */
  Hardfault_IRQn                = -13,              /*!<   3  处理器内部错误 */
  MemManage_IRQn                = -12,              /*!<   4  MPU错误 */
  BusFault_IRQn                 = -11,              /*!<   5  总线错误 */
  UsageFault_IRQn               = -10,              /*!<   6  指令执行错误 */
  SVCall_IRQn                   = -5,               /*!<  11  SupervisorCall */
  DebugMonitor_IRQn             = -4,               /*!<  11  DebugMonitor */
  PendSV_IRQn                   = -2,               /*!<  14  系统服务请求 */
  SysTick_IRQn                  = -1,               /*!<  15  内核定时器中断 */

/* --------------------  Cortex-M0 Specific Interrupt Numbers  --------------------*/
  WWDT_IRQn                     = 0,                /*!<   0  WWDT */
  SVD_IRQn                      = 1,                /*!<   1  SVD */
  RTC_IRQn                      = 2,                /*!<   2  RTC */
  IWDT_IRQn                     = 3,                /*!<   3  IWDT */
  FLASH_IRQn                    = 4,                /*!<   4  FLASH */
  CMU_IRQn                      = 5,                /*!<   5  CMU */
  LFDET_IRQn                    = 6,                /*!<   6  LFDET */
  MAP_ERR_IRQn                  = 7,                /*!<   7  MAP_ERR */
  ADC_IRQn                     	= 8,                /*!<   8  ADC */
  DAC0_IRQn                     = 9,                /*!<   9  DAC0 */
  DAC1_IRQn                     = 10,               /*!<  10  DAC1 */
  SPI0_IRQn                    	= 11,               /*!<  11  SPI0 */
  SPI1_IRQn                    	= 12,               /*!<  12  SPI1 */
  SPI2_IRQn                    	= 13,               /*!<  13  SPI2 */
  SPI3_IRQn                    	= 14,               /*!<  14  SPI3 */
  SPI4_IRQn                    	= 15,               /*!<  15  SPI4 */
  UART0_IRQn                    = 18,               /*!<  16  UART0 */
  UART1_IRQn                    = 19,               /*!<  17  UART1 */
  UART2_IRQn                    = 20,               /*!<  18  UART2 */
  UART3_IRQn                  	= 21,               /*!<  19  UART3 */
  UART4_IRQn                    = 22,               /*!<  20  UART4 */
  UART5_IRQn                    = 23,               /*!<  21  UART5 */
  UART6_IRQn                    = 24,               /*!<  22  UART6 */
  UART7_IRQn                    = 25,               /*!<  23  UART7 */
  LPUART0_IRQn                  = 29,               /*!<  29  LPUART0 */
  LPUART1_IRQn                  = 30,               /*!<  30  LPUART1 */
  EXTIA_IRQn                  	= 32,               /*!<  32  EXTIA */
  EXTIB_IRQn                  	= 33,               /*!<  33  EXTIB */
  EXTIC_IRQn                    = 34,               /*!<  34  EXTIC */
  EXTID_IRQn                    = 35,               /*!<  35  EXTID */
  EXTIE_IRQn                    = 36,               /*!<  36  EXTIE */
  EXTIF_IRQn                    = 37,               /*!<  37  EXTIF */
  I2CM0_IRQn                    = 38,               /*!<  38  I2CM0 */
  I2CM1_IRQn                    = 39,               /*!<  39  I2CM1 */
  I2CSMB0_IRQn                  = 40,               /*!<  40  I2CSMB0 */
  I2CSMB1_IRQn                  = 41,               /*!<  41  I2CSMB1 */
  I2CSMB2_IRQn                  = 42,               /*!<  42  I2CSMB2 */
  CCL_IRQn                    	= 45,               /*!<  45  CCL */
  AES_IRQn                      = 46,               /*!<  46  AES */
  DMA_IRQn                    	= 50,               /*!<  50  DMA */
  WKUPX_IRQn                    = 51,               /*!<  51  WKUPX */
  LUT_IRQn                  	= 52,               /*!<  52  LUT */
  COMPX_IRQn                    = 53,               /*!<  53  COMPX */
  FSCAN_IRQn                    = 54,               /*!<  54  FSCAN */
  FDCAN_IRQn                    = 56,               /*!<  56  FDCAN */
  LPTIM16_IRQn                  = 60,               /*!<  60  LPTIM16 */
  BSTIM0_IRQn                   = 62,               /*!<  62  BSTIM0 */
  ATIM0_IRQn                    = 64,               /*!<  64  ATIM0 */
  ATIM1_IRQn                    = 65,               /*!<  65  ATIM1 */
  GPTIM0_IRQn                   = 68,               /*!<  68  GPTIM0 */
  GPTIM1_IRQn                   = 69,               /*!<  69  GPTIM1 */
  GPTIM2_IRQn                   = 70,               /*!<  70  GPTIM2 */
  EPWM0_IRQn                    = 72,               /*!<  72  EPWM0 */
  EPWM0_TZ_IRQn                 = 73,               /*!<  73  EPWM0_TZ */
  EPWM1_IRQn                    = 74,               /*!<  74  EPWM1 */
  EPWM1_TZ_IRQn                 = 75,               /*!<  75  EPWM1_TZ */
  EPWM2_IRQn                    = 76,               /*!<  76  EPWM2 */
  EPWM2_TZ_IRQn                 = 77,               /*!<  77  EPWM2_TZ */
  EPWM3_IRQn                    = 78,               /*!<  78  EPWM3 */
  EPWM3_TZ_IRQn                 = 79,               /*!<  79  EPWM3_TZ */
  FPU_IRQn                      = 82,               /*!<  82  FPU */
  USB_IRQn                      = 83,               /*!<  83  USB */
  EPSC_IRQn                     = 85,               /*!<  85  EPSC */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* --------  Configuration of the Cortex-M33 Processor and Core Peripherals  ------ */
#define __CM33_REV                0x0000U   /* Core revision r0p1 */
#define __SAUREGION_PRESENT       0U        /* SAU regions present */
#define __MPU_PRESENT             1U        /* MPU present */
#define __VTOR_PRESENT            1U        /* VTOR present */
#define __NVIC_PRIO_BITS          3U        /* Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig    0U        /* Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT             1U        /* FPU present */
#define __DSP_PRESENT             1U        /* DSP extension present */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm33.h"                            /*!< Cortex-M0 processor and core peripherals */
#include "system_fm33fk5xx.h"                         /*!< FM33FKXX System */

/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */

/** @addtogroup Device_Peripheral_Registers
  * @{
  */

/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
#warning Not supported compiler type
#endif


/* ================================================================================ */
/* ================                       FLS                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RDCR;                   /*!<  FlashReadControlRegister,                             Address offset: 0x00 */
  __IO uint32_t RSV1[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x04 */
  __IO uint32_t EPCR;                   /*!<  FlashErase/ProgramControlRegister,                    Address offset: 0x14 */
  __O  uint32_t KEY;                    /*!<  FlashKeyRegister,                                     Address offset: 0x18 */
  __IO uint32_t IER;                    /*!<  FlashInterruptEnableRegister,                         Address offset: 0x1C */
  __IO uint32_t ISR;                    /*!<  FlashInterruptStatusRegister,                         Address offset: 0x20 */
}FLASH_Type;


/* ================================================================================ */
/* ================                       PMU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  PowerManagementControlRegister,                       Address offset: 0x00 */
  __IO uint32_t WKTR;                   /*!<  WakeupTimeRegister,                                   Address offset: 0x04 */
  __IO uint32_t WKFR;                   /*!<  WakeupSourceFlagsRegister1,                           Address offset: 0x08 */
  __IO uint32_t WKFR1;                  /*!<  WakeupSourceFlagsRegister2,                           Address offset: 0x0C */
  __IO uint32_t RSV1;                	/*!<  RESERVED REGISTER,                                    Address offset: 0x10 */
  __IO uint32_t RAMCR;                	/*!<  RESERVED REGISTER,                                    Address offset: 0x14 */
  __IO uint32_t RSV2[8];                /*!<  RESERVED REGISTER,                                    Address offset: 0x18 */
  __IO uint32_t ULPB_TR;                /*!<  ,                                                     Address offset: 0x38 */
  __IO uint32_t BUFCR;     				/*!<  ,                                                     Address offset: 0x3C */
  __IO uint32_t RSV3[4];     			/*!<  ,                                                     Address offset: 0x40 */
  __IO uint32_t PTAT_CR;                /*!<  PTATControlRegister,                               	Address offset: 0x50 */
  __IO uint32_t RSV4[11];     			/*!<  ,                                                     Address offset: 0x54 */
  __IO uint32_t PHYCR;                  /*!<  ,                                                     Address offset: 0x80 */
}PMU_Type;


/* ================================================================================ */
/* ================                       VREFP                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RSV1[16];               /*!<  RESERVED REGISTER,                       				Address offset: 0x00 */
  __IO uint32_t CR;               		/*!<  VREFPControlRegister,                                 Address offset: 0x40 */
  __IO uint32_t CFGR;             		/*!<  VREFPConfigRegister,                               	Address offset: 0x44 */
  __IO uint32_t RSV2;              		/*!<  VREFPStatusandInterruptRegister,                      Address offset: 0x48 */
  __IO uint32_t TR;               		/*!<  VREFPTrimRegister,                                 	Address offset: 0x4C */
}VREFP_Type;


/* ================================================================================ */
/* ================                       VAO                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RSTCR;                  /*!<  VBATResetControlRegister,                             Address offset: 0x00 */
  __IO uint32_t XTLFCR;                 /*!<  XTLFControlRegister,                                  Address offset: 0x04 */
  __IO uint32_t FDIER;                  /*!<  XTLFOscillationFailDetectionInterruptEnableRegister,  Address offset: 0x08 */
  __IO uint32_t FDISR;                  /*!<  XTLFOscillationFailDetectionInterruptStatusRegister,  Address offset: 0x0C */
  __IO uint32_t RSV1[252];              /*!<  RESERVED REGISTER,                                    Address offset: 0x10 */
  __IO uint32_t INEN;                   /*!<  VAOIOInputEnableRegister,                             Address offset: 0x400 */
  __IO uint32_t PUEN;                   /*!<  VAOIOPull-upEnableRegister,                           Address offset: 0x404 */
  __IO uint32_t ODEN;                   /*!<  VAOIOOpenDrainEnableRegister,                         Address offset: 0x408 */
  __IO uint32_t FCR;                    /*!<  VAOIOFunctionControlRegister,                         Address offset: 0x40C */
  __IO uint32_t DOR;                    /*!<  VAOIODataOutputRegister,                              Address offset: 0x410 */
  __I  uint32_t DIR;                    /*!<  VAOIODataInputRegister,                               Address offset: 0x414 */
  __IO uint32_t VILR;                   /*!<  VAOIOVoltageInputLowRegister,                         Address offset: 0x418 */
}VAO_Type;


/* ================================================================================ */
/* ================                      CDIF                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t PRSC;                   /*!<  ,                                                     Address offset: 0x04 */
}CDIF_Type;


/* ================================================================================ */
/* ================                       RMU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x00 */
  __IO uint32_t BORCR;                  /*!<  BORControlRegister,                                   Address offset: 0x04 */
  __IO uint32_t RSTCFG;                 /*!<  ResetConfigRegister,                                  Address offset: 0x08 */
  __O  uint32_t SOFTRST;                /*!<  SoftwareResetRegister,                                Address offset: 0x0C */
  __IO uint32_t RSTFLAG;                /*!<  ResetFlagRegister,                                    Address offset: 0x10 */
  __O  uint32_t PERHRSTEN;              /*!<  PeripheralResetEnableRegister,                        Address offset: 0x14 */
  __IO uint32_t AHBRST;                 /*!<  AHBPeripheralsResetRegister,                          Address offset: 0x18 */
  __IO uint32_t APBRST1;                /*!<  APBPeripheralsResetRegister1,                         Address offset: 0x1C */
  __IO uint32_t APBRST2;                /*!<  APBPeripheralsResetRegister2,                         Address offset: 0x20 */
}RMU_Type;


/* ================================================================================ */
/* ================                      IWDT                      ================ */
/* ================================================================================ */

typedef struct
{
  __O  uint32_t SERV;                   /*!<  IWDTServiceRegister,                                  Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  IWDTConfigRegister,                                   Address offset: 0x04 */
  __I  uint32_t CNT;                    /*!<  IWDTCounterRegister,                                  Address offset: 0x08 */
  __IO uint32_t WIN;                    /*!<  IWDTWindowRegister,                                   Address offset: 0x0C */
  __IO uint32_t IER;                    /*!<  IWDTInterruptEnableRegister,                          Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<  IWDTInterruptStatusRegister,                          Address offset: 0x14 */
}IWDT_Type;


/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */

typedef struct
{
  __O  uint32_t CR;                     /*!<  WWDTControlRegister,                                  Address offset: 0x00 */
  __IO uint32_t CFGR;                   /*!<  WWDTConfigRegister,                                   Address offset: 0x04 */
  __I  uint32_t CNT;                    /*!<  WWDTCounterRegister,                                  Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  WWDTInterruptEnableRegister,                          Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  WWDTInterruptStatusRegister,                          Address offset: 0x10 */
  __I  uint32_t PSC;                    /*!<  WWDTPrescalerRegister,                                Address offset: 0x14 */
}WWDT_Type;


/* ================================================================================ */
/* ================                       CMU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t SYSCLKCR;               /*!<  SystemClockControlRegister,                           Address offset: 0x00 */
  __IO uint32_t RCHFCR;                 /*!<  RCHFControlRegister,                                  Address offset: 0x04 */
  __IO uint32_t RCHFTR;                 /*!<  RCHFTrimRegister,                                     Address offset: 0x08 */
  __IO uint32_t PLLCR;                  /*!<  PLLControlRegister,                                   Address offset: 0x0C */
  __IO uint32_t RCLPCR;                 /*!<  RCLPControlRegister,                                  Address offset: 0x10 */
  __IO uint32_t RCLPTR;                 /*!<  RCLPTrimRegister,                                     Address offset: 0x14 */
  __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x18 */
  __IO uint32_t XTHFCR;                  /*!<  XTHFControlRegister,                                  Address offset: 0x20 */
  __IO uint32_t RSV2[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t IER;                    /*!<  InterruptEnableRegister,                              Address offset: 0x2C */
  __IO uint32_t ISR;                    /*!<  InterruptStatusRegister,                              Address offset: 0x30 */
  __IO uint32_t PCLKCR1;                /*!<  PeripheralbusClockControlRegister1,                   Address offset: 0x34 */
  __IO uint32_t PCLKCR2;                /*!<  PeripheralbusClockControlRegister2,                   Address offset: 0x38 */
  __IO uint32_t PCLKCR3;                /*!<  PeripheralbusClockControlRegister3,                   Address offset: 0x3C */
  __IO uint32_t PCLKCR4;                /*!<  PeripheralbusClockControlRegister4,                   Address offset: 0x40 */
  __IO uint32_t OPCCR1;                 /*!<  PeripheralClockConfigRegister1,                       Address offset: 0x44 */
  __IO uint32_t OPCCR2;                 /*!<  PeripheralClockConfigRegister2,                       Address offset: 0x48 */
  __IO uint32_t OPCER1;                 /*!<  PeripheralClockEnableRegister,                        Address offset: 0x4C */
  __IO uint32_t OPCER2;                 /*!<  PeripheralClockEnableRegister2,                       Address offset: 0x50 */
  __IO uint32_t AHBMCR;                 /*!<  AHBMasterControlRegister,                             Address offset: 0x54 */
  __IO uint32_t CCCR;                   /*!<  ClockCalibrationControlRegister,                      Address offset: 0x58 */
  __IO uint32_t CCFR;                   /*!<  ClockCalibrationConfigRegister,                       Address offset: 0x5C */
  __I  uint32_t CCNR;                   /*!<  ClockCalibrationCounterRegister,                      Address offset: 0x60 */
  __IO uint32_t CCISR;                  /*!<  ClockCalibrationInterruptStatusRegister,              Address offset: 0x64 */
}CMU_Type;


/* ================================================================================ */
/* ================                       SVD                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CFGR;                   /*!<  SVDConfigRegister,                                    Address offset: 0x00 */
  __IO uint32_t CR;                     /*!<  SVDControlRegister,                                   Address offset: 0x04 */
  __IO uint32_t IER;                    /*!<  SVDInterruptEnableRegister,                           Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  SVDInterruptStatusRegister,                           Address offset: 0x0C */
  __IO uint32_t VSR;                    /*!<  SVDreferenceVoltageSelectRegister,                    Address offset: 0x10 */
}SVD_Type;


/* ================================================================================ */
/* ================                       AES                      ================ */
/* ================================================================================ */

