waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/Device/Include/fm33fk5xx.h
typedef struct
{
  __IO uint32_t CR;                     /*!<  AESControlRegister,                                   Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  AESInterruptEnableRegister,                           Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  AESInterruptStatusRegister,                           Address offset: 0x08 */
  __IO uint32_t DIR;                    /*!<  AESDataInputRegister,                                 Address offset: 0x0C */
  __I  uint32_t DOR;                    /*!<  AESDataOutputRegister,                                Address offset: 0x10 */
  __IO uint32_t KEY0;                   /*!<  AESKeyRegister0,                                      Address offset: 0x14 */
  __IO uint32_t KEY1;                   /*!<  AESKeyRegister1,                                      Address offset: 0x18 */
  __IO uint32_t KEY2;                   /*!<  AESKeyRegister2,                                      Address offset: 0x1C */
  __IO uint32_t KEY3;                   /*!<  AESKeyRegister3,                                      Address offset: 0x20 */
  __IO uint32_t KEY4;                   /*!<  AESKeyRegister4,                                      Address offset: 0x24 */
  __IO uint32_t KEY5;                   /*!<  AESKeyRegister5,                                      Address offset: 0x28 */
  __IO uint32_t KEY6;                   /*!<  AESKeyRegister6,                                      Address offset: 0x2C */
  __IO uint32_t KEY7;                   /*!<  AESKeyRegister7,                                      Address offset: 0x30 */
  __IO uint32_t IVR0;                   /*!<  AESInitialVectorRegister0,                            Address offset: 0x34 */
  __IO uint32_t IVR1;                   /*!<  AESInitialVectorRegister1,                            Address offset: 0x38 */
  __IO uint32_t IVR2;                   /*!<  AESInitialVectorRegister2,                            Address offset: 0x3C */
  __IO uint32_t IVR3;                   /*!<  AESInitialVectorRegister3,                            Address offset: 0x40 */
  __IO uint32_t H0;                     /*!<  AESMultHparameterRegister0,                           Address offset: 0x44 */
  __IO uint32_t H1;                     /*!<  AESMultHparameterRegister1,                           Address offset: 0x48 */
  __IO uint32_t H2;                     /*!<  AESMultHparameterRegister2,                           Address offset: 0x4C */
  __IO uint32_t H3;                     /*!<  AESMultHparameterRegister3,                           Address offset: 0x50 */
}AES_Type;


/* ================================================================================ */
/* ================                       RNG                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  RandomNumberGeneratorControlRegister,                 Address offset: 0x00 */
  __I  uint32_t DOR;                    /*!<  RandomNumberGeneratorDataOutputRegister,              Address offset: 0x04 */
  __IO uint32_t RSV1[2];                /*!<  RESERVED REGISTER,                                    Address offset: 0x08 */
  __IO uint32_t SR;                     /*!<  RandomNumberGeneratorStatusRegister,                  Address offset: 0x10 */
  __IO uint32_t CRCCR;                 /*!<  CRCControlRegister,                                   Address offset: 0x14 */
  __IO uint32_t CRCDIR;                /*!<  CRCDatainputRegister,                                 Address offset: 0x18 */
  __IO uint32_t CRCSR;                 /*!<  CRCStatusRegister,                                    Address offset: 0x1C */
}RNG_Type;


/* ================================================================================ */
/* ================                      COMP                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;              		/*!< ComparatorControl Register 1,                        Address offset: 0x00 */

}COMP_Type;

typedef struct
{
  __IO uint32_t ICR;             		/*!< Comparator Interrupt Config Register,                Address offset: 0x00 */
  __IO uint32_t ISR;             		/*!< Comparator Interrupt Status Register,                Address offset: 0x04 */
  __IO uint32_t RSV0;            		/*!< RESERVED REGISTER0,                                  Address offset: 0x08 */  
  __IO uint32_t BUFCR;           		/*!< Comparator Interrupt Status Register,                Address offset: 0x0C */
} COMP_COMMON_Type;

/* ================================================================================ */
/* ================                     I2CSMBx                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  I2CSMBusControlRegister,                              Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  I2CSMBusControlRegister,                              Address offset: 0x04 */
  __IO uint32_t IER;                    /*!<  I2CSMBusIntteruptEnableRegister,                      Address offset: 0x08 */
  __IO uint32_t ISR;                    /*!<  I2CMasterInterruptStatusRegister,                     Address offset: 0x0C */
  __IO uint32_t BGR;                    /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t TCR;                    /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t TOR;                    /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t RXBUF;                  /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t TXBUF;                  /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t SADR;                   /*!<  ,                                                     Address offset: 0x24 */
  __I  uint32_t CRCDR;                  /*!<  ,                                                     Address offset: 0x28 */
  __IO uint32_t CRCLFSR;                /*!<  ,                                                     Address offset: 0x2C */
  __IO uint32_t CRCPOLY;                /*!<  ,                                                     Address offset: 0x30 */
}I2CSMB_Type;


/* ================================================================================ */
/* ================                      I2Cx                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t MSPCFGR;                /*!<  I2CMasterConfigRegister,                              Address offset: 0x00 */
  __IO uint32_t MSPCR;                  /*!<  I2CMasterControlRegister,                             Address offset: 0x04 */
  __IO uint32_t MSPIER;                 /*!<  I2CMasterIntteruptEnableRegister,                     Address offset: 0x08 */
  __IO uint32_t MSPISR;                 /*!<  I2CMasterInterruptStatusRegister,                     Address offset: 0x0C */
  __IO uint32_t MSPSR;                  /*!<  I2CMasterStatusRegister,                              Address offset: 0x10 */
  __IO uint32_t MSPBGR;                 /*!<  I2CMasterBaudrateGeneratorRegister,                   Address offset: 0x14 */
  __IO uint32_t MSPBUF;                 /*!<  I2CMastertransferBuffer,                              Address offset: 0x18 */
  __IO uint32_t MSPTCR;                 /*!<  I2CMasterTimingControlRegister,                       Address offset: 0x1C */
  __IO uint32_t MSPTOR;                 /*!<  I2CMasterTime-OutRegister,                            Address offset: 0x20 */
}I2C_Type;


/* ================================================================================ */
/* ================                      UART                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t IRCR;                   /*!<  InfraredmodulationControlRegister,                    Address offset: 0x00 */
}UART_COMMON_Type;


/* ================================================================================ */
/* ================                      UARTx                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CSR;                    /*!<  UARTxControlStatusRegister,                           Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  UARTxInterruptEnableRegister,                         Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  UARTxInterruptStatusRegister,                         Address offset: 0x08 */
  __IO uint32_t TODR;                   /*!<  UARTxTime-OutandDelayRegister,                        Address offset: 0x0C */
  __I  uint32_t RXBUF;                  /*!<  UARTxReceiveBuffer,                                   Address offset: 0x10 */
  __O  uint32_t TXBUF;                  /*!<  UARTxTransmitBuffer,                                  Address offset: 0x14 */
  __IO uint32_t BGR;                    /*!<  UARTxBaudrateGeneratorRegister,                       Address offset: 0x18 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t MCR;                    /*!<  UARTxModeControlRegister,                             Address offset: 0x20 */
  __IO uint32_t LINCR;                  /*!<  UARTxLINControlRegister,                              Address offset: 0x24 */
  __I  uint32_t LINBSR;                 /*!<  UARTxLINBaudSyncRegister,                             Address offset: 0x28 */
  __IO uint32_t LINFTR;                 /*!<  UARTxLINFrameTimeoutRegister,                         Address offset: 0x2C */
  __IO uint32_t LINTTR;                 /*!<  UARTxLINTransmitTimingRegister,                       Address offset: 0x30 */
  __I  uint32_t LINPSR;                 /*!<  UARTLINPre-syncbaudregister,                          Address offset: 0x34 */
  __IO uint32_t LINBKR;                 /*!<  ,                                                     Address offset: 0x38 */
  __IO uint32_t RSV2;               		/*!<  RESERVED REGISTER,                                    Address offset: 0x3C */
  __IO uint32_t SCISR;                  /*!<  UARTxSmartCardInterruptStatusRegister,                Address offset: 0x40 */
  __IO uint32_t SCIER;                  /*!<  UARTxSmartCardInterruptEnableRegister,                Address offset: 0x44 */
  __IO uint32_t FFCR;                   /*!<  UARTxSmartCardFrameFormatControlRegister,             Address offset: 0x48 */
  __IO uint32_t EGTR;                   /*!<  UARTxSmartCardExtraGuardTimeRegister,                 Address offset: 0x4C */
  __IO uint32_t CODR;                   /*!<  UARTxSmartCardClockOutputRegister,                    Address offset: 0x50 */
  __IO uint32_t RSV3[11];               /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
  __IO uint32_t LINSCCR;                /*!<  LINSelf-testCwitchControlRegister,                    Address offset: 0x80 */
}UART_Type;


/* ================================================================================ */
/* ================                     LPUARTx                    ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CSR;                    /*!<  LPUARTxControlStatusRegister,                         Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  LPUARTxInterruptEnableRegister,                       Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  LPUARTxInterruptStatusRegister,                       Address offset: 0x08 */
  __IO uint32_t BMR;                    /*!<  LPUARTxBaudrateModulationRegister,                    Address offset: 0x0C */
  __I  uint32_t RXBUF;                  /*!<  LPUARTxReceiveBufferRegister,                         Address offset: 0x10 */
  __IO uint32_t TXBUF;                  /*!<  LPUARTxTransmitBufferRegister,                        Address offset: 0x14 */
  __IO uint32_t DMR;                    /*!<  LPUARTxdataMatchingRegister,                          Address offset: 0x18 */
}LPUART_Type;


/* ================================================================================ */
/* ================                      SPIx                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  SPIxControlRegister1,                                 Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  SPIxControlRegister2,                                 Address offset: 0x04 */
  __IO uint32_t CR3;                    /*!<  ControlRegister3,                                     Address offset: 0x08 */
  __IO uint32_t IER;                    /*!<  SPIxInterruptEnableRegister,                          Address offset: 0x0C */
  __IO uint32_t ISR;                    /*!<  SPIxStatusRegister,                                   Address offset: 0x10 */
  __O  uint32_t TXBUF;                  /*!<  SPIxTransmitBuffer,                                   Address offset: 0x14 */
  __I  uint32_t RXBUF;                  /*!<  SPIxReceiveBuffer,                                    Address offset: 0x18 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t I2SCR;                  /*!<  I2SControlRegister,                                   Address offset: 0x20 */
  __IO uint32_t I2SPR;                  /*!<  SPIxI2SPrescalerRegister,                             Address offset: 0x24 */
}SPI_Type;


/* ================================================================================ */
/* ================                      EPSC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t NCR1;                   /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t NTR1;                   /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t NWTR1;                  /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x0C */
  __IO uint32_t NCR2;                   /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t NTR2;                   /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t NWTR2;                  /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t RSV2;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t NCR3;                   /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t NTR3;                   /*!<  ,                                                     Address offset: 0x24 */
  __IO uint32_t NWTR3;                  /*!<  ,                                                     Address offset: 0x28 */
  __IO uint32_t RSV3;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x2C */
  __IO uint32_t NCR4;                   /*!<  ,                                                     Address offset: 0x30 */
  __IO uint32_t NTR4;                   /*!<  ,                                                     Address offset: 0x34 */
  __IO uint32_t NWTR4;                  /*!<  ,                                                     Address offset: 0x38 */
  __IO uint32_t RSV4[5];                /*!<  RESERVED REGISTER,                                    Address offset: 0x3C */
  __IO uint32_t ISR;                    /*!<  ,                                                     Address offset: 0x50 */
  __IO uint32_t IER;                    /*!<  ,                                                     Address offset: 0x54 */
  __IO uint32_t TO;                     /*!<  ,                                                     Address offset: 0x58 */
}EPSC_Type;


/* ================================================================================ */
/* ================                       CAN                      ================ */
/* ================================================================================ */

