waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/Device/Include/fm33fk5xx.h
typedef struct
{
  __IO uint32_t CR;                     /*!<  CANControlRegister,                                   Address offset: 0x00 */
  __IO uint32_t MSR;                    /*!<  CANmodeselectregister,                                Address offset: 0x04 */
  __IO uint32_t BRPR;                   /*!<  CANBaudratePrescalerRegister,                         Address offset: 0x08 */
  __IO uint32_t BTR;                    /*!<  CANBitTimingRegister,                                 Address offset: 0x0C */
  __IO  uint32_t ECR;                    /*!<  CANErrorCounterRegister,                              Address offset: 0x10 */
  __IO uint32_t ESR;                    /*!<  CANErrorStatusRegister,                               Address offset: 0x14 */
  __I  uint32_t SR;                     /*!<  CANStatusRegister,                                    Address offset: 0x18 */
  __IO  uint32_t RX_ISR;                 /*!<  CANInterruptStatusRegister,                           Address offset: 0x1C */
  __IO uint32_t RX_IER;                 /*!<  CANInterruptEnableRegister,                           Address offset: 0x20 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t TXB_CR;                 /*!<  CANTransmitBufferControlRegister,                     Address offset: 0x28 */
  __IO uint32_t TXB_SR;                 /*!<  CANTransmitBufferStatusRegister,                      Address offset: 0x2C */
  __O  uint32_t TXB0_IDR;               /*!<  CANTransmitBuffer0IDRegister,                         Address offset: 0x30 */
  __O  uint32_t TXB0_DLCR;              /*!<  CANTransmitBuffer0DLCRegister,                        Address offset: 0x34 */
  __O  uint32_t TXB0_DW1R;              /*!<  CANTransmitBuffer0DataWord1Register,                  Address offset: 0x38 */
  __O  uint32_t TXB0_DW2R;              /*!<  CANTransmitBuffer0DataWord2Register,                  Address offset: 0x3C */
  __O  uint32_t TXB1_IDR;               /*!<  CANTransmitBuffer1IDRegister,                         Address offset: 0x40 */
  __O  uint32_t TXB1_DLCR;              /*!<  CANTransmitBuffer1DLCRegister,                        Address offset: 0x44 */
  __O  uint32_t TXB1_DW1R;              /*!<  CANTransmitBuffer1DataWord1Register,                  Address offset: 0x48 */
  __O  uint32_t TXB1_DW2R;              /*!<  CANTransmitBuffer1DataWord2Register,                  Address offset: 0x4C */
  __O  uint32_t TXB2_IDR;               /*!<  CANTransmitBuffer2IDRegister,                         Address offset: 0x50 */
  __O  uint32_t TXB2_DLCR;              /*!<  CANTransmitBuffer2DLCRegister,                        Address offset: 0x54 */
  __O  uint32_t TXB2_DW1R;              /*!<  CANTransmitBuffer2DataWord1Register,                  Address offset: 0x58 */
  __O  uint32_t TXB2_DW2R;              /*!<  CANTransmitBuffer2DataWord2Register,                  Address offset: 0x5C */
  __IO uint32_t AFCR;                   /*!<  AcceptanceFilterControlRegister,                      Address offset: 0x60 */
  __IO uint32_t AFCFGR;                 /*!<  AcceptanceFilterConfigRegister,                       Address offset: 0x64 */
  __IO uint32_t RSV2[6];                /*!<  RESERVED REGISTER,                                    Address offset: 0x68 */
  __IO uint32_t AFMR0;                  /*!<  AcceptanceFilterMaskRegister0,                        Address offset: 0x80 */
  __IO uint32_t AFIR0;                  /*!<  AcceptanceFilterIDRegister0,                          Address offset: 0x84 */
  __IO uint32_t AFMR1;                  /*!<  AcceptanceFilterMaskRegister1,                        Address offset: 0x88 */
  __IO uint32_t AFIR1;                  /*!<  AcceptanceFilterIDRegister1,                          Address offset: 0x8C */
  __IO uint32_t AFMR2;                  /*!<  ,                                                     Address offset: 0x90 */
  __IO uint32_t AFIR2;                  /*!<  ,                                                     Address offset: 0x94 */
  __IO uint32_t AFMR3;                  /*!<  ,                                                     Address offset: 0x98 */
  __IO uint32_t AFIR3;                  /*!<  ,                                                     Address offset: 0x9C */
  __IO uint32_t AFMR4;                  /*!<  ,                                                     Address offset: 0xA0 */
  __IO uint32_t AFIR4;                  /*!<  ,                                                     Address offset: 0xA4 */
  __IO uint32_t AFMR5;                  /*!<  ,                                                     Address offset: 0xA8 */
  __IO uint32_t AFIR5;                  /*!<  ,                                                     Address offset: 0xAC */
  __IO uint32_t AFMR6;                  /*!<  ,                                                     Address offset: 0xB0 */
  __IO uint32_t AFIR6;                  /*!<  ,                                                     Address offset: 0xB4 */
  __IO uint32_t AFMR7;                  /*!<  ,                                                     Address offset: 0xB8 */
  __IO uint32_t AFIR7;                  /*!<  ,                                                     Address offset: 0xBC */
  __IO uint32_t AFMR8;                  /*!<  ,                                                     Address offset: 0xC0 */
  __IO uint32_t AFIR8;                  /*!<  ,                                                     Address offset: 0xC4 */
  __IO uint32_t AFMR9;                  /*!<  ,                                                     Address offset: 0xC8 */
  __IO uint32_t AFIR9;                  /*!<  ,                                                     Address offset: 0xCC */
  __IO uint32_t AFMR10;                 /*!<  ,                                                     Address offset: 0xD0 */
  __IO uint32_t AFIR10;                 /*!<  ,                                                     Address offset: 0xD4 */
  __IO uint32_t AFMR11;                 /*!<  ,                                                     Address offset: 0xD8 */
  __IO uint32_t AFIR11;                 /*!<  ,                                                     Address offset: 0xDC */
  __IO uint32_t AFMR12;                 /*!<  ,                                                     Address offset: 0xE0 */
  __IO uint32_t AFIR12;                 /*!<  ,                                                     Address offset: 0xE4 */
  __IO uint32_t AFMR13;                 /*!<  ,                                                     Address offset: 0xE8 */
  __IO uint32_t AFIR13;                 /*!<  ,                                                     Address offset: 0xEC */
  __IO uint32_t AFMR14;                 /*!<  ,                                                     Address offset: 0xF0 */
  __IO uint32_t AFIR14;                 /*!<  ,                                                     Address offset: 0xF4 */
  __IO uint32_t AFMR15;                 /*!<  AcceptanceFilterMaskRegister15,                       Address offset: 0xF8 */
  __IO uint32_t AFIR15;                 /*!<  AcceptanceFilterIDRegister15,                         Address offset: 0xFC */
  __O  uint32_t RXF_IDR;                /*!<  CANRXFIFOIDRegister,                                  Address offset: 0x100 */
  __O  uint32_t RXF_DLCR;               /*!<  CANRXFIFODLCRegister,                                 Address offset: 0x104 */
  __O  uint32_t RXF_DW1R;               /*!<  CANRXFIFODataWord1Register,                           Address offset: 0x108 */
  __O  uint32_t RXF_DW2R;               /*!<  CANRXFIFODataWord2Register,                           Address offset: 0x10C */
}CAN_Type;


/* ================================================================================ */
/* ================                      FDCAN                     ================ */
/* ================================================================================ */

