waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/Device/Include/fm33fk5xx.h
typedef struct
{
  __IO uint32_t CR;                     /*!<  FDCANControlRegister,                                 Address offset: 0x00 */
  __IO uint32_t MSR;                    /*!<  FDCANmodeselectregister,                              Address offset: 0x04 */
  __IO uint32_t NBTR;                   /*!<  FDCANNominalBitTimingRegister,                        Address offset: 0x08 */
  __IO uint32_t DBTR;                   /*!<  FDCANDataBitTimingRegister,                           Address offset: 0x0C */
  __IO uint32_t TDCR;                   /*!<  FDCANTransmissionDelayCompensationRegister,           Address offset: 0x10 */
  __IO uint32_t TSCR;                   /*!<  FDCANTimeStampConfigRegister,                         Address offset: 0x14 */
  __IO uint32_t TSVR;                   /*!<  FDCANTimeStampValueRegister,                          Address offset: 0x18 */
  __IO uint32_t TOCR;                   /*!<  FDCANTimeOutConfigRegister,                           Address offset: 0x1C */
  __IO uint32_t TOVR;                   /*!<  FDCANTimeOutValueRegister,                            Address offset: 0x20 */
  __I  uint32_t ECR;                    /*!<  FDCANErrorCounterRegister,                            Address offset: 0x24 */
  __IO uint32_t ESR;                    /*!<  FDCANErrorStatusRegister,                             Address offset: 0x28 */
  __IO uint32_t SR;                     /*!<  StatusRegister,                                       Address offset: 0x2C */
  __I  uint32_t RXISR;                  /*!<  FDCANInterruptStatusRegister,                         Address offset: 0x30 */
  __IO uint32_t RXIER;                  /*!<  FDCANInterruptEnableRegister,                         Address offset: 0x34 */
  __IO uint32_t TXCR;                   /*!<  TransmitConfigRegister,                               Address offset: 0x38 */
  __IO uint32_t TXSR;                   /*!<  TransmitStatusRegister,                               Address offset: 0x3C */
  __I  uint32_t TXFSR;                  /*!<  ,                                                     Address offset: 0x40 */
  __I  uint32_t RXFSR;                  /*!<  ,                                                     Address offset: 0x44 */
  __O  uint32_t TXB0_IDR;               /*!<  FDCANTransmitBuffer0IDRegister,                       Address offset: 0x48 */
  __O  uint32_t TXB0_DLCR;              /*!<  FDCANTransmitBuffer0DLCRegister,                      Address offset: 0x4C */
  __O  uint32_t TXB0_DW0R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x50 */
  __O  uint32_t TXB0_DW1R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x54 */      
  __O  uint32_t TXB0_DW2R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x58 */
  __O  uint32_t TXB0_DW3R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x5C */
  __O  uint32_t TXB0_DW4R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x60 */
  __O  uint32_t TXB0_DW5R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x64 */
  __O  uint32_t TXB0_DW6R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x68 */
  __O  uint32_t TXB0_DW7R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x6C */
  __O  uint32_t TXB0_DW8R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x70 */
  __O  uint32_t TXB0_DW9R;              /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x74 */
  __O  uint32_t TXB0_DW10R;             /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x78 */
  __O  uint32_t TXB0_DW11R;             /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x7C */
  __O  uint32_t TXB0_DW12R;             /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x80 */
  __O  uint32_t TXB0_DW13R;             /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x84 */
  __O  uint32_t TXB0_DW14R;             /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x88 */
  __O  uint32_t TXB0_DW15R;             /*!<  FDCANTransmitBuffer0DataWordRegistery                 Address offset: 0x8C */
  __O  uint32_t TXB1_IDR;               /*!<  FDCANTransmitBuffer1IDRegister,                       Address offset: 0x90 */
  __O  uint32_t TXB1_DLCR;              /*!<  FDCANTransmitBuffer1DLCRegister,                      Address offset: 0x94 */
  __O  uint32_t TXB1_DW0R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0x98 */
  __O  uint32_t TXB1_DW1R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0x9C */
  __O  uint32_t TXB1_DW2R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xA0 */
  __O  uint32_t TXB1_DW3R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xA4 */
  __O  uint32_t TXB1_DW4R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xA8 */
  __O  uint32_t TXB1_DW5R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xAC */
  __O  uint32_t TXB1_DW6R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xB0 */
  __O  uint32_t TXB1_DW7R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xB4 */
  __O  uint32_t TXB1_DW8R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xB8 */
  __O  uint32_t TXB1_DW9R;              /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xBC */
  __O  uint32_t TXB1_DW10R;             /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xC0 */
  __O  uint32_t TXB1_DW11R;             /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xC4 */
  __O  uint32_t TXB1_DW12R;             /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xC8 */
  __O  uint32_t TXB1_DW13R;             /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xCC */
  __O  uint32_t TXB1_DW14R;             /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xD0 */
  __O  uint32_t TXB1_DW15R;             /*!<  FDCANTransmitBuffer1DataWordRegistery                 Address offset: 0xD4 */
  __O  uint32_t TXB2_IDR;               /*!<  FDCANTransmitBuffer2IDRegister,                       Address offset: 0xD8 */
  __O  uint32_t TXB2_DLCR;              /*!<  FDCANTransmitBuffer2DLCRegister,                      Address offset: 0xDC */
  __O  uint32_t TXB2_DW0R;              /*!<  FDCANTransmitBuffer2DataWordRegistery                 Address offset: 0xE0 */
  __O  uint32_t TXB2_DW1R;              /*!<  FDCANTransmitBuffer2DataWordRegistery                 Address offset: 0xE4 */
  __O  uint32_t TXB2_DW2R;              /*!<  FDCANTransmitBuffer2DataWordRegistery                 Address offset: 0xE8 */
  __O  uint32_t TXB2_DW3R;              /*!<  FDCANTransmitBuffer2DataWordRegistery                 Address offset: 0xEC */
  __O  uint32_t TXB2_DW4R;              /*!<  FDCANTransmitBuffer2DataWordRegistery                 Address offset: 0xF0 */
  __O  uint32_t TXB2_DW5R;              /*!<  FDCANTransmitBuffer2DataWordRegistery                 Address offset: 0xF4 */
  __O  uint32_t TXB2_DW6R;              /*!<  FDCANTransmitBuffer2DataWordRegistery                 Address offset: 0xF8 */
  __O  uint32_t TXB2_DW7R;              /*!<  FDCANTransmitBuffer2DataWordRegistery Address offset: 0xFC */
  __O  uint32_t TXB2_DW8R;              /*!<  FDCANTransmitBuffer2DataWordRegistery)
y=0~15,        Address offset: 0x100 */
  __O  uint32_t TXB2_DW9R;              /*!<  FDCANTransmitBuffer2DataWordRegistery)
y=0~15,        Address offset: 0x104 */
  __O  uint32_t TXB2_DW10R;             /*!<  FDCANTransmitBuffer2DataWordRegistery)
y=0~15,        Address offset: 0x108 */
  __O  uint32_t TXB2_DW11R;             /*!<  FDCANTransmitBuffer2DataWordRegistery)
y=0~15,        Address offset: 0x10C */
  __O  uint32_t TXB2_DW12R;             /*!<  FDCANTransmitBuffer2DataWordRegistery)
y=0~15,        Address offset: 0x110 */
  __O  uint32_t TXB2_DW13R;             /*!<  FDCANTransmitBuffer2DataWordRegistery)
y=0~15,        Address offset: 0x114 */
  __O  uint32_t TXB2_DW14R;             /*!<  FDCANTransmitBuffer2DataWordRegistery)
y=0~15,        Address offset: 0x118 */
  __O  uint32_t TXB2_DW15R;             /*!<  FDCANTransmitBuffer2DataWordRegistery)
y=0~15,        Address offset: 0x11C */
  __O  uint32_t RXF_IDR;                /*!<  FDCANReceiveFIFOIDRegister,                           Address offset: 0x120 */
  __O  uint32_t RXF_DLCR;               /*!<  FDCANReceiveFIFODLCRegister,                          Address offset: 0x124 */
  __O  uint32_t RXF_DW0R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x128 */
  __O  uint32_t RXF_DW1R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x12C */
  __O  uint32_t RXF_DW2R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x130 */
  __O  uint32_t RXF_DW3R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x134 */
  __O  uint32_t RXF_DW4R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x138 */
  __O  uint32_t RXF_DW5R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x13C */
  __O  uint32_t RXF_DW6R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x140 */
  __O  uint32_t RXF_DW7R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x144 */
  __O  uint32_t RXF_DW8R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x148 */
  __O  uint32_t RXF_DW9R;               /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x14C */
  __O  uint32_t RXF_DW10R;              /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x150 */
  __O  uint32_t RXF_DW11R;              /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x154 */
  __O  uint32_t RXF_DW12R;              /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x158 */
  __O  uint32_t RXF_DW13R;              /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x15C */
  __O  uint32_t RXF_DW14R;              /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x160 */
  __O  uint32_t RXF_DW15R;              /*!<  FDCANReceiveFIFODataWordRegistery)
y=0~15,            Address offset: 0x164 */
  __IO uint32_t AFCR;                   /*!<  FDCANAcceptanceFilterControlRegister,                 Address offset: 0x168 */
  __IO uint32_t AFBIR0;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x16C */
  __IO uint32_t AFBIR1;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x170 */
  __IO uint32_t AFBIR2;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x174 */
  __IO uint32_t AFBIR3;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x178 */
  __IO uint32_t AFBIR4;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x17C */
  __IO uint32_t AFBIR5;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x180 */
  __IO uint32_t AFBIR6;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x184 */
  __IO uint32_t AFBIR7;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x188 */
  __IO uint32_t AFBIR8;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x18C */
  __IO uint32_t AFBIR9;                 /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x190 */
  __IO uint32_t AFBIR10;                /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x194 */
  __IO uint32_t AFBIR11;                /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x198 */
  __IO uint32_t AFBIR12;                /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x19C */
  __IO uint32_t AFBIR13;                /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x1A0 */
  __IO uint32_t AFBIR14;                /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x1A4 */
  __IO uint32_t AFBIR15;                /*!<  FDCANAcceptanceFilterBasicIDRegister,                 Address offset: 0x1A8 */
  __IO uint32_t AFEIR0F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1AC */
  __IO uint32_t AFEIR0F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1B0 */
  __IO uint32_t AFEIR1F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1B4 */
  __IO uint32_t AFEIR1F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1B8 */
  __IO uint32_t AFEIR2F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1BC */
  __IO uint32_t AFEIR2F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1C0 */
  __IO uint32_t AFEIR3F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1C4 */
  __IO uint32_t AFEIR3F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1C8 */
  __IO uint32_t AFEIR4F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1CC */
  __IO uint32_t AFEIR4F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1D0 */
  __IO uint32_t AFEIR5F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1D4 */
  __IO uint32_t AFEIR5F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1D8 */
  __IO uint32_t AFEIR6F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1DC */
  __IO uint32_t AFEIR6F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1E0 */
  __IO uint32_t AFEIR7F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1E4 */
  __IO uint32_t AFEIR7F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1E8 */
  __IO uint32_t AFEIR8F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1EC */
  __IO uint32_t AFEIR8F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1F0 */
  __IO uint32_t AFEIR9F0;               /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1F4 */
  __IO uint32_t AFEIR9F1;               /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x1F8 */
  __IO uint32_t AFEIR10F0;              /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x1FC */
  __IO uint32_t AFEIR10F1;              /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x200 */
  __IO uint32_t AFEIR11F0;              /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x204 */
  __IO uint32_t AFEIR11F1;              /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x208 */
  __IO uint32_t AFEIR12F0;              /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x20C */
  __IO uint32_t AFEIR12F1;              /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x210 */
  __IO uint32_t AFEIR13F0;              /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x214 */
  __IO uint32_t AFEIR13F1;              /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x218 */
  __IO uint32_t AFEIR14F0;              /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x21C */
  __IO uint32_t AFEIR14F1;              /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x220 */
  __IO uint32_t AFEIR15F0;              /*!<  FDCANAcceptanceFilterExtendedIDF0Register,            Address offset: 0x224 */
  __IO uint32_t AFEIR15F1;              /*!<  AcceptanceFilterExtendedIDF1Register,                 Address offset: 0x228 */
}FDCAN_Type;


/* ================================================================================ */
/* ================                       DMA                      ================ */
/* ================================================================================ */

