waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/Device/Include/fm33fk5xx.h
/* ================================================================================ */
/* ================                      RTCB                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t WER;                    /*!<  RTCBWrite Enable Register,                            Address offset: 0x00 */
  __IO uint32_t IER;                    /*!<  RTCBInterrupt Enable Register,                        Address offset: 0x04 */
  __IO uint32_t ISR;                    /*!<  RTCBInterrupt Status Register,                        Address offset: 0x08 */
  __IO uint32_t BCDSEC;                 /*!<  BCD format time second registers,                     Address offset: 0x0C */
  __IO uint32_t BCDMIN;                 /*!<  BCD format time minute registers,                     Address offset: 0x10 */
  __IO uint32_t BCDHOUR;                /*!<  BCD format time hour registers,                       Address offset: 0x14 */
  __IO uint32_t BCDDAY;                 /*!<  BCD format time day registers,                        Address offset: 0x18 */
  __IO uint32_t BCDWEEK;                /*!<  BCD format time week registers,                       Address offset: 0x1C */
  __IO uint32_t BCDMONTH;               /*!<  BCD format time month registers,                      Address offset: 0x20 */
  __IO uint32_t BCDYEAR;                /*!<  BCD format time year registers,                       Address offset: 0x24 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x28 */
  __IO uint32_t TMSEL;                  /*!<  RTCB Time Mark Select,                                Address offset: 0x2C */
  __IO uint32_t ADJR;                   /*!<  RTCB time Adjust Register,                            Address offset: 0x30 */
  __IO uint32_t RSV2[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x34 */
  __IO uint32_t CR;                     /*!<  RTCB Control Register,                                Address offset: 0x40 */
  __IO uint32_t RSV3;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x44 */
  __IO uint32_t STPCR;                  /*!<  RTCB Time Stamp Control Register,                     Address offset: 0x48 */
  __IO uint32_t STPCLKRR;               /*!<  RTC Time Stamp Clock Record Register,                 Address offset: 0x4C */
  __IO uint32_t STPCALRR;               /*!<  RTCB Time Stamp Calendar Record Register,             Address offset: 0x50 */
  __IO uint32_t RSV4[7];                /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
  __IO uint32_t BKR0;                   /*!<  RTCBBackup Register0,                                 Address offset: 0x70 */
  __IO uint32_t BKR1;                   /*!<  RTCB Backup Register1,                                Address offset: 0x74 */
  __IO uint32_t BKR2;                   /*!<  RTCB Backup Register2,                                Address offset: 0x78 */
  __IO uint32_t BKR3;                   /*!<  RTCB Backup Register3,                                Address offset: 0x7C */
  __IO uint32_t BKR4;                   /*!<  RTCB Backup Register4,                                Address offset: 0x80 */
}RTCB_Type;


/* ================================================================================ */
/* ================                       ADC                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t ACQ_ISR;                /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t ACQ_IER;                /*!<  ,                                                     Address offset: 0x04 */
  __IO  uint32_t GISR;                   /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t GIER;                   /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t CR1;                    /*!<  ,                                                     Address offset: 0x10 */
  __O  uint32_t CR2;                    /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t CALR;                   /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t CFGR1;                  /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t CFGR2;                  /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t PRICR;                  /*!<  ,                                                     Address offset: 0x24 */
  __IO uint32_t DMR;                    /*!<  ,                                                     Address offset: 0x28 */
  __IO uint32_t OSR;                    /*!<  ,                                                     Address offset: 0x2C */
  __I  uint32_t ACQ_SR;                 /*!<  ,                                                     Address offset: 0x30 */
  __IO uint32_t RSV1[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x34 */
  __IO uint32_t ACQ0_CR;                /*!<  ,                                                     Address offset: 0x40 */
  __IO uint32_t ACQ1_CR;                /*!<  ,                                                     Address offset: 0x44 */
  __IO uint32_t ACQ2_CR;                /*!<  ,                                                     Address offset: 0x48 */
  __IO uint32_t ACQ3_CR;                /*!<  ,                                                     Address offset: 0x4C */
  __IO uint32_t ACQ4_CR;                /*!<  ,                                                     Address offset: 0x50 */
  __IO uint32_t ACQ5_CR;                /*!<  ,                                                     Address offset: 0x54 */
  __IO uint32_t ACQ6_CR;                /*!<  ,                                                     Address offset: 0x58 */
  __IO uint32_t ACQ7_CR;                /*!<  ,                                                     Address offset: 0x5C */
  __IO uint32_t ACQ8_CR;                /*!<  ,                                                     Address offset: 0x60 */
  __IO uint32_t ACQ9_CR;                /*!<  ,                                                     Address offset: 0x64 */
  __IO uint32_t ACQ10_CR;               /*!<  ,                                                     Address offset: 0x68 */
  __IO uint32_t ACQ11_CR;               /*!<  ,                                                     Address offset: 0x6C */
  __IO uint32_t ACQ12_CR;               /*!<  ,                                                     Address offset: 0x70 */
  __IO uint32_t ACQ13_CR;               /*!<  ,                                                     Address offset: 0x74 */
  __IO uint32_t ACQ14_CR;               /*!<  ,                                                     Address offset: 0x78 */
  __IO uint32_t ACQ15_CR;               /*!<  ,                                                     Address offset: 0x7C */
  __I  uint32_t ACQ0_DR;                /*!<  ,                                                     Address offset: 0x80 */
  __I  uint32_t ACQ1_DR;                /*!<  ,                                                     Address offset: 0x84 */
  __I  uint32_t ACQ2_DR;                /*!<  ,                                                     Address offset: 0x88 */
  __I  uint32_t ACQ3_DR;                /*!<  ,                                                     Address offset: 0x8C */
  __I  uint32_t ACQ4_DR;                /*!<  ,                                                     Address offset: 0x90 */
  __I  uint32_t ACQ5_DR;                /*!<  ,                                                     Address offset: 0x94 */
  __I  uint32_t ACQ6_DR;                /*!<  ,                                                     Address offset: 0x98 */
  __I  uint32_t ACQ7_DR;                /*!<  ,                                                     Address offset: 0x9C */
  __I  uint32_t ACQ8_DR;                /*!<  ,                                                     Address offset: 0xA0 */
  __I  uint32_t ACQ9_DR;                /*!<  ,                                                     Address offset: 0xA4 */
  __I  uint32_t ACQ10_DR;               /*!<  ,                                                     Address offset: 0xA8 */
  __I  uint32_t ACQ11_DR;               /*!<  ,                                                     Address offset: 0xAC */
  __I  uint32_t ACQ12_DR;               /*!<  ,                                                     Address offset: 0xB0 */
  __I  uint32_t ACQ13_DR;               /*!<  ,                                                     Address offset: 0xB4 */
  __I  uint32_t ACQ14_DR;               /*!<  ,                                                     Address offset: 0xB8 */
  __I  uint32_t ACQ15_DR;               /*!<  ,                                                     Address offset: 0xBC */
  __IO  uint32_t DMACOMB_CR;             /*!<  ,                                                     Address offset: 0xC0 */
  __I  uint32_t DMACOMB_DR;             /*!<  ,                                                     Address offset: 0xC4 */
}ADC_Type;


/* ================================================================================ */
/* ================                      DACx                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR1;                    /*!<  DACxControlRegister,                                  Address offset: 0x00 */
  __IO uint32_t CR2;                    /*!<  DACxControlRegister,                                  Address offset: 0x04 */
  __IO uint32_t CFGR;                   /*!<  DACxConfigRegister,                                   Address offset: 0x08 */
  __O  uint32_t SWTRGR;                 /*!<  DACxSoftwareTriggerRegister,                          Address offset: 0x0C */
  __IO uint32_t DHR;                    /*!<  DACxDataHoldingRegister,                              Address offset: 0x10 */
  __IO uint32_t ISR;                    /*!<  DACxInterruptStatusRegister,                          Address offset: 0x14 */
  __IO uint32_t IER;                    /*!<  DACxInterruptEnableRegister,                          Address offset: 0x18 */
  __IO uint32_t SHTR;                   /*!<  DACxSampleHoldTimeRegister,                           Address offset: 0x1C */
}DAC_Type;


/* ================================================================================ */
/* ================                      OPAx                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  OPAxControlRegister,                                  Address offset: 0x00 */
  __IO uint32_t CALR;                   /*!<  OPAxCalibrationRegister,                              Address offset: 0x04 */
  __I  uint32_t COR;                    /*!<  OPAxCalibrationOutputRegister,                        Address offset: 0x08 */
}OPA_Type;


/* ================================================================================ */
/* ================                       PGL                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t CFGR0;                  /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t CFGR1;                  /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t CFGR2;                  /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t CFGR3;                  /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t IER;                    /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t ISR;                    /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t LUT0;                   /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t LUT1;                   /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t LUT2;                   /*!<  ,                                                     Address offset: 0x24 */
  __IO uint32_t LUT3;                   /*!<  ,                                                     Address offset: 0x28 */
}PGL_Type;


/* ================================================================================ */
/* ================                     USBPHY                     ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t PHYCR;                  /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t BCKCR;                  /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t PHYTEST;                /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t PHYPD;                  /*!<  ,                                                     Address offset: 0x0C */
}USBPHY_Type;


/* ================================================================================ */
/* ================                       USB                      ================ */
/* ================================================================================ */

