waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/Device/Include/fm33fk5xx.h
typedef struct
{
  __IO uint32_t GCTL;                     /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t GINT;                     /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t GAHBCFG;                /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t GUSBCFG;                /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t GRSTCTL;                /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t GINTSTS;                /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t GINTMSK;                /*!<  ,                                                     Address offset: 0x18 */
  __I  uint32_t GRXSTSR;                /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t GRXSTSP;                /*!<  ,                                                     Address offset: 0x20 */
  __I  uint32_t GRXFSIZ;                /*!<  ,                                                     Address offset: 0x24 */
  __I  uint32_t GNPTXFSIZ;              /*!<  ,                                                     Address offset: 0x28 */
  __I  uint32_t GNPTXSTS;               /*!<  ,                                                     Address offset: 0x2C */
  __IO uint32_t RSV1[4];                /*!<  RESERVED REGISTER,                                    Address offset: 0x30 */
  __IO uint32_t GSNPSID;                /*!<  ,                                                     Address offset: 0x40 */
  __IO uint32_t GHWCFG1;                /*!<  ,                                                     Address offset: 0x44 */
  __IO uint32_t GHWCFG2;                /*!<  ,                                                     Address offset: 0x48 */
  __IO uint32_t GHWCFG3;                /*!<  ,                                                     Address offset: 0x4C */
  __IO uint32_t GHWCFG4;                /*!<  ,                                                     Address offset: 0x50 */
  __IO uint32_t RSV2[43];               /*!<  RESERVED REGISTER,                                    Address offset: 0x54 */
  __IO uint32_t HPTXFSIZ;               /*!<  ,                                                     Address offset: 0x100 */
  __I  uint32_t DIEPTXF1;               /*!<  ,                                                     Address offset: 0x104 */
  __I  uint32_t DIEPTXF2;               /*!<  ,                                                     Address offset: 0x108 */
  __I  uint32_t DIEPTXF3;               /*!<  ,                                                     Address offset: 0x10C */
  __I  uint32_t DIEPTXF4;               /*!<  ,                                                     Address offset: 0x110 */
  __IO uint32_t RSV3[187];              /*!<  RESERVED REGISTER,                                    Address offset: 0x114 */
  __IO uint32_t HCFG;                   /*!<  ,                                                     Address offset: 0x400 */
  __IO uint32_t HFIR;                   /*!<  ,                                                     Address offset: 0x404 */
  __I  uint32_t HFNUM;                  /*!<  ,                                                     Address offset: 0x408 */
  __IO uint32_t RSV4;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x40C */
  __IO uint32_t HPTXSTS;                /*!<  ,                                                     Address offset: 0x410 */
  __I  uint32_t HAINT;                  /*!<  ,                                                     Address offset: 0x414 */
  __I  uint32_t HAINTMSK;               /*!<  ,                                                     Address offset: 0x418 */
  __IO uint32_t RSV5[9];                /*!<  RESERVED REGISTER,                                    Address offset: 0x41C */
  __IO uint32_t HPRT;                   /*!<  ,                                                     Address offset: 0x440 */
  __IO uint32_t RSV6[47];               /*!<  RESERVED REGISTER,                                    Address offset: 0x444 */
  __IO uint32_t HCCHAR0;                /*!<  ,                                                     Address offset: 0x500 */
  __IO uint32_t RSV7;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x504 */
  __IO uint32_t HCINT0;                 /*!<  ,                                                     Address offset: 0x508 */
  __IO uint32_t HCINTMSK0;              /*!<  ,                                                     Address offset: 0x50C */
  __IO uint32_t HCTSIZE0;               /*!<  ,                                                     Address offset: 0x510 */
  __IO uint32_t RSV8[3];                /*!<  RESERVED REGISTER,                                    Address offset: 0x514 */
  __IO uint32_t HCCHAR1;                /*!<  ,                                                     Address offset: 0x520 */
  __IO uint32_t RSV9;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x524 */
  __IO uint32_t HCINT1;                 /*!<  ,                                                     Address offset: 0x528 */
  __IO uint32_t HCINTMSK1;              /*!<  ,                                                     Address offset: 0x52C */
  __IO uint32_t HCTSIZE1;               /*!<  ,                                                     Address offset: 0x530 */
  __IO uint32_t RSV10[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0x534 */
  __IO uint32_t HCCHAR2;                /*!<  ,                                                     Address offset: 0x540 */
  __IO uint32_t RSV11;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x544 */
  __IO uint32_t HCINT2;                 /*!<  ,                                                     Address offset: 0x548 */
  __IO uint32_t HCINTMSK2;              /*!<  ,                                                     Address offset: 0x54C */
  __IO uint32_t HCTSIZE2;               /*!<  ,                                                     Address offset: 0x550 */
  __IO uint32_t RSV12[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0x554 */
  __IO uint32_t HCCHAR3;                /*!<  ,                                                     Address offset: 0x560 */
  __IO uint32_t RSV13;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x564 */
  __IO uint32_t HCINT3;                 /*!<  ,                                                     Address offset: 0x568 */
  __IO uint32_t HCINTMSK3;              /*!<  ,                                                     Address offset: 0x56C */
  __IO uint32_t HCTSIZE3;               /*!<  ,                                                     Address offset: 0x570 */
  __IO uint32_t RSV14[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0x574 */
  __IO uint32_t HCCHAR4;                /*!<  ,                                                     Address offset: 0x580 */
  __IO uint32_t RSV15;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x584 */
  __IO uint32_t HCINT4;                 /*!<  ,                                                     Address offset: 0x588 */
  __IO uint32_t HCINTMSK4;              /*!<  ,                                                     Address offset: 0x58C */
  __IO uint32_t HCTSIZE4;               /*!<  ,                                                     Address offset: 0x590 */
  __IO uint32_t RSV16[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0x594 */
  __IO uint32_t HCCHAR5;                /*!<  ,                                                     Address offset: 0x5A0 */
  __IO uint32_t RSV17;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x5A4 */
  __IO uint32_t HCINT5;                 /*!<  ,                                                     Address offset: 0x5A8 */
  __IO uint32_t HCINTMSK5;              /*!<  ,                                                     Address offset: 0x5AC */
  __IO uint32_t HCTSIZE5;               /*!<  ,                                                     Address offset: 0x5B0 */
  __IO uint32_t RSV18[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0x5B4 */
  __IO uint32_t HCCHAR6;                /*!<  ,                                                     Address offset: 0x5C0 */
  __IO uint32_t RSV19;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x5C4 */
  __IO uint32_t HCINT6;                 /*!<  ,                                                     Address offset: 0x5C8 */
  __IO uint32_t HCINTMSK6;              /*!<  ,                                                     Address offset: 0x5CC */
  __IO uint32_t HCTSIZE6;               /*!<  ,                                                     Address offset: 0x5D0 */
  __IO uint32_t RSV20[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0x5D4 */
  __IO uint32_t HCCHAR7;                /*!<  ,                                                     Address offset: 0x5E0 */
  __IO uint32_t RSV21;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x5E4 */
  __IO uint32_t HCINT7;                 /*!<  ,                                                     Address offset: 0x5E8 */
  __IO uint32_t HCINTMSK7;              /*!<  ,                                                     Address offset: 0x5EC */
  __IO uint32_t HCTSIZE7;               /*!<  ,                                                     Address offset: 0x5F0 */
  __IO uint32_t RSV22[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0x5F4 */
  __IO uint32_t HCCHAR8;                /*!<  ,                                                     Address offset: 0x600 */
  __IO uint32_t RSV23;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x604 */
  __IO uint32_t HCINT8;                 /*!<  ,                                                     Address offset: 0x608 */
  __IO uint32_t HCINTMSK8;              /*!<  ,                                                     Address offset: 0x60C */
  __IO uint32_t HCTSIZE8;               /*!<  ,                                                     Address offset: 0x610 */
  __IO uint32_t RSV24[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0x614 */
  __IO uint32_t HCCHAR9;                /*!<  ,                                                     Address offset: 0x620 */
  __IO uint32_t RSV25;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x624 */
  __IO uint32_t HCINT9;                 /*!<  ,                                                     Address offset: 0x628 */
  __IO uint32_t HCINTMSK9;              /*!<  ,                                                     Address offset: 0x62C */
  __IO uint32_t HCTSIZE9;               /*!<  ,                                                     Address offset: 0x630 */
  __IO uint32_t RSV26[116];             /*!<  RESERVED REGISTER,                                    Address offset: 0x634 */
  __IO uint32_t DCTL;                   /*!<  ,                                                     Address offset: 0x804 */
  __I  uint32_t DSTS;                   /*!<  ,                                                     Address offset: 0x808 */
  __IO uint32_t RSV27;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x80C */
  __IO uint32_t DIEPMSK;                /*!<  ,                                                     Address offset: 0x810 */
  __IO uint32_t DOEPMSK;                /*!<  ,                                                     Address offset: 0x814 */
  __I  uint32_t DAINT;                  /*!<  ,                                                     Address offset: 0x818 */
  __IO uint32_t DAINTMSK;               /*!<  ,                                                     Address offset: 0x81C */
  __IO uint32_t RSV28[5];               /*!<  RESERVED REGISTER,                                    Address offset: 0x820 */
  __IO uint32_t DIEPEMPMSK;             /*!<  ,                                                     Address offset: 0x834 */
  __IO uint32_t RSV29[50];              /*!<  RESERVED REGISTER,                                    Address offset: 0x838 */
  __IO uint32_t DIEPCTL0;               /*!<  ,                                                     Address offset: 0x900 */
  __IO uint32_t RSV30;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x904 */
  __IO uint32_t DIEPINT0;               /*!<  ,                                                     Address offset: 0x908 */
  __IO uint32_t RSV31;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x90C */
  __IO uint32_t DIEPTSIZ0;              /*!<  ,                                                     Address offset: 0x910 */
  __IO uint32_t RSV32;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x914 */
  __IO uint32_t DTXFSTS0;               /*!<  ,                                                     Address offset: 0x918 */
  __IO uint32_t RSV33;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x91C */
  __IO uint32_t DIEPCTL1;               /*!<  ,                                                     Address offset: 0x920 */
  __IO uint32_t RSV34;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x924 */
  __IO uint32_t DIEPINT1;               /*!<  ,                                                     Address offset: 0x928 */
  __IO uint32_t RSV35;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x92C */
  __IO uint32_t DIEPTSIZ1;              /*!<  ,                                                     Address offset: 0x930 */
  __IO uint32_t RSV36;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x934 */
  __IO uint32_t DTXFSTS1;               /*!<  ,                                                     Address offset: 0x938 */
  __IO uint32_t RSV37;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x93C */
  __IO uint32_t DIEPCTL2;               /*!<  ,                                                     Address offset: 0x940 */
  __IO uint32_t RSV38;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x944 */
  __IO uint32_t DIEPINT2;               /*!<  ,                                                     Address offset: 0x948 */
  __IO uint32_t RSV39;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x94C */
  __IO uint32_t DIEPTSIZ2;              /*!<  ,                                                     Address offset: 0x950 */
  __IO uint32_t RSV40;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x954 */
  __IO uint32_t DTXFSTS2;               /*!<  ,                                                     Address offset: 0x958 */
  __IO uint32_t RSV41;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x95C */
  __IO uint32_t DIEPCTL3;               /*!<  ,                                                     Address offset: 0x960 */
  __IO uint32_t RSV42;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x964 */
  __IO uint32_t DIEPINT3;               /*!<  ,                                                     Address offset: 0x968 */
  __IO uint32_t RSV43;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x96C */
  __IO uint32_t DIEPTSIZ3;              /*!<  ,                                                     Address offset: 0x970 */
  __IO uint32_t RSV44;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x974 */
  __IO uint32_t DTXFSTS3;               /*!<  ,                                                     Address offset: 0x978 */
  __IO uint32_t RSV45;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x97C */
  __IO uint32_t DIEPCTL4;               /*!<  ,                                                     Address offset: 0x980 */
  __IO uint32_t RSV46;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x984 */
  __IO uint32_t DIEPINT4;               /*!<  ,                                                     Address offset: 0x988 */
  __IO uint32_t RSV47;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x98C */
  __IO uint32_t DIEPTSIZ4;              /*!<  ,                                                     Address offset: 0x990 */
  __IO uint32_t RSV48;                  /*!<  RESERVED REGISTER,                                    Address offset: 0x994 */
  __IO uint32_t DTXFSTS4;               /*!<  ,                                                     Address offset: 0x998 */
  __IO uint32_t RSV49[89];              /*!<  RESERVED REGISTER,                                    Address offset: 0x99C */
  __IO uint32_t DOEPCTL0;               /*!<  ,                                                     Address offset: 0xB00 */
  __IO uint32_t RSV50;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB04 */
  __IO uint32_t DOEPINT0;               /*!<  ,                                                     Address offset: 0xB08 */
  __IO uint32_t RSV51;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB0C */
  __IO uint32_t DOEPTSIZ0;              /*!<  ,                                                     Address offset: 0xB10 */
  __IO uint32_t RSV52[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0xB14 */
  __IO uint32_t DOEPCTL1;               /*!<  ,                                                     Address offset: 0xB20 */
  __IO uint32_t RSV53;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB24 */
  __IO uint32_t DOEPINT1;               /*!<  ,                                                     Address offset: 0xB28 */
  __IO uint32_t RSV54;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB2C */
  __IO uint32_t DOEPTSIZ1;              /*!<  ,                                                     Address offset: 0xB30 */
  __IO uint32_t RSV55[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0xB34 */
  __IO uint32_t DOEPCTL2;               /*!<  ,                                                     Address offset: 0xB40 */
  __IO uint32_t RSV56;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB44 */
  __IO uint32_t DOEPINT2;               /*!<  ,                                                     Address offset: 0xB48 */
  __IO uint32_t RSV57;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB4C */
  __IO uint32_t DOEPTSIZ2;              /*!<  ,                                                     Address offset: 0xB50 */
  __IO uint32_t RSV58[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0xB54 */
  __IO uint32_t DOEPCTL3;               /*!<  ,                                                     Address offset: 0xB60 */
  __IO uint32_t RSV59;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB64 */
  __IO uint32_t DOEPINT3;               /*!<  ,                                                     Address offset: 0xB68 */
  __IO uint32_t RSV60;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB6C */
  __IO uint32_t DOEPTSIZ3;              /*!<  ,                                                     Address offset: 0xB70 */
  __IO uint32_t RSV61[3];               /*!<  RESERVED REGISTER,                                    Address offset: 0xB74 */
  __IO uint32_t DOEPCTL4;               /*!<  ,                                                     Address offset: 0xB80 */
  __IO uint32_t RSV62;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB84 */
  __IO uint32_t DOEPINT4;               /*!<  ,                                                     Address offset: 0xB88 */
  __IO uint32_t RSV63;                  /*!<  RESERVED REGISTER,                                    Address offset: 0xB8C */
  __IO uint32_t DOEPTSIZ4;              /*!<  ,                                                     Address offset: 0xB90 */
  __IO uint32_t RSV64[155];             /*!<  RESERVED REGISTER,                                    Address offset: 0xB94 */
  __IO uint32_t PCGCCTL;                /*!<  ,                                                     Address offset: 0xE00 */
}USB_Type;


/* ================================================================================ */
/* ================                      GPIO                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t EXTISEL0;               /*!<  ExternalInterruptInputSelectRegister0,                Address offset: 0x00 */
  __IO uint32_t EXTISEL1;               /*!<  ExternalInterruptInputSelectRegister1,                Address offset: 0x04 */
  __IO uint32_t EXTIEDS0;               /*!<  ExternalInterruptEdgeSelectandEnableRegister0,        Address offset: 0x08 */
  __IO uint32_t EXTIEDS1;               /*!<  ExternalInterruptEdgeSelectandEnableRegister1,        Address offset: 0x0C */
  __IO uint32_t EXTIDF;                 /*!<  ExternalInterruptDigitalFilterRegister,               Address offset: 0x10 */
  __IO uint32_t EXTIISR;                /*!<  ExternalInterruptandStatusRegister,                   Address offset: 0x14 */
  __IO uint32_t EXTIDI;                 /*!<  ExternalInterruptDataInputRegister,                   Address offset: 0x18 */
  __IO uint32_t RSV4[9];                /*!<  RESERVED REGISTER,                                    Address offset: 0x1C */
  __IO uint32_t FOUTSEL;                /*!<  FrequencyOutputSelectRegister,                        Address offset: 0x40 */
  __IO uint32_t RSV5[63];               /*!<  RESERVED REGISTER,                                    Address offset: 0x44 */
  __IO uint32_t PINWKEN;                /*!<  WakeupEnableRegister,                                 Address offset: 0x140 */
}GPIO_COMMON_Type;


