waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/Device/Include/fm33fk5xx.h
typedef struct
{
  __IO uint32_t INEN;                   /*!<  GPIOxInputEnableRegister,                             Address offset: 0x00 */
  __IO uint32_t PUDEN;                  /*!<  GPIOxPull-UpPull-DownEnableRegister,                  Address offset: 0x04 */
  __IO uint32_t ODEN;                   /*!<  GPIOxOpen-DrainEnableRegister,                        Address offset: 0x08 */
  __IO uint32_t FCR;                    /*!<  GPIOxFunctionControlRegister,                         Address offset: 0x0C */
  __IO uint32_t DO;                     /*!<  GPIOxDataOutputRegister,                              Address offset: 0x10 */
  __O  uint32_t DSET;                   /*!<  GPIOxDataSetRegister,                                 Address offset: 0x14 */
  __O  uint32_t DRST;                   /*!<  GPIOxDataResetRegister,                               Address offset: 0x18 */
  __I  uint32_t DIN;                    /*!<  GPIOxDataInputRegister,                               Address offset: 0x1C */
  __IO uint32_t DFS;                    /*!<  GPIOxDigitalFunctionSelect,                           Address offset: 0x20 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x24 */
  __IO uint32_t ANEN;                   /*!<  GPIOxAnalogchannelEnableRegister,                     Address offset: 0x28 */
  __IO uint32_t DSR;                    /*!<  GPIOxDriverStrengthRegister,                          Address offset: 0x2C */
}GPIO_Type;
/* ================================================================================ */
/* ================                       SFU                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t RAMP_CR;                /*!<  RAMParityControlRegister,                             Address offset: 0x00 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x04 */
  __IO uint32_t MAP_CR;                 /*!<  MemoryAccessProtectionControlRegister,                Address offset: 0x08 */
  __IO uint32_t MAP_SR;                 /*!<  MemoryAccessProtectionControlRegister,                Address offset: 0x0C */
}SFU_Type;


/* ================================================================================ */
/* ================                      QSPI                      ================ */
/* ================================================================================ */

typedef struct
{
  __IO uint32_t CR;                     /*!<  ,                                                     Address offset: 0x00 */
  __IO uint32_t SR;                     /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t RMCR;                   /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t OMCR;                   /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t RABR;                   /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t OABR;                   /*!<  ,                                                     Address offset: 0x14 */
  __IO uint32_t IMAR;                   /*!<  ,                                                     Address offset: 0x18 */
  __IO uint32_t FDR;                    /*!<  ,                                                     Address offset: 0x1C */
  __IO uint32_t DLR;                    /*!<  ,                                                     Address offset: 0x20 */
  __IO uint32_t WCNT;                   /*!<  ,                                                     Address offset: 0x24 */
}QSPI_Type;



/* ================================================================================ */
/* ================                       SCU                      ================ */
/* ================================================================================ */

typedef struct
{
  __I  uint32_t SYSCFG;                 /*!<  ,                                                     Address offset: 0x00 */
  __I  uint32_t USRCFG;                 /*!<  ,                                                     Address offset: 0x04 */
  __IO uint32_t DBGCFG;                 /*!<  ,                                                     Address offset: 0x08 */
  __IO uint32_t RAMCFG;                 /*!<  ,                                                     Address offset: 0x0C */
  __IO uint32_t FLS_ACLOCK1;            /*!<  ,                                                     Address offset: 0x10 */
  __IO uint32_t FLS_ACLOCK2;            /*!<  ,                                                     Address offset: 0x14 */
  __I  uint32_t RAMRP00;                /*!<  ,                                                     Address offset: 0x18 */
  __I  uint32_t RAMRP01;                /*!<  ,                                                     Address offset: 0x1C */
  __I  uint32_t RAMRP10;                /*!<  ,                                                     Address offset: 0x20 */
  __I  uint32_t RAMRP11;                /*!<  ,                                                     Address offset: 0x24 */
  __IO uint32_t RSV1;                   /*!<  RESERVED REGISTER,                                    Address offset: 0x28 */
  __I  uint32_t FLS_TSTEN;              /*!<  ,                                                     Address offset: 0x2C */
  __I  uint32_t SCU_VRSR;               /*!<  ,                                                     Address offset: 0x30 */
  __I  uint32_t FLS_DCT0;               /*!<  ,                                                     Address offset: 0x34 */
  __I  uint32_t FLS_DCT1;               /*!<  ,                                                     Address offset: 0x38 */
}SCU_Type;



/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif


/* ================================================================================ */
/* ================              CPU memory map                    ================ */
/* ================================================================================ */


/* Peripheral and SRAM base address */

