waterinthefall/FDU-Microelectronics-Development-Project/.pack/FMSH/FM33FK5XX_DFP.1.0.2/Device/Include/fm33fk5xx.h
#define FLASH_BASE            ((     uint32_t)0x00000000)
#define SRAM_BASE             ((     uint32_t)0x20000000)
#define PERIPH_BASE           ((     uint32_t)0x40000000)


/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

/* Peripheral memory map */
#define SCU_BASE                        (PERIPH_BASE        +0x00000000)
#define FLS_BASE                        (PERIPH_BASE        +0x00001000)
#define PMU_BASE                        (PERIPH_BASE        +0x00002000)
#define VAO_BASE                        (PERIPH_BASE        +0x0001F800)
#define CDIF_BASE                       (PERIPH_BASE        +0x0001EC00)
#define RMU_BASE                        (PERIPH_BASE        +0x00002800)
#define IWDT_BASE                       (PERIPH_BASE        +0x00021000)
#define WWDT_BASE                       (PERIPH_BASE        +0x00011800)
#define CMU_BASE                        (PERIPH_BASE        +0x00002400)
#define SVD_BASE                        (PERIPH_BASE        +0x00021400)
#define AES_BASE                        (PERIPH_BASE        +0x0001B800)
#define RNG_BASE                        (PERIPH_BASE        +0x0001BC00)
#define COMP0_BASE                      (PERIPH_BASE        +0x00022400)
#define COMP1_BASE                      (PERIPH_BASE        +0x00022404)
#define COMP2_BASE                      (PERIPH_BASE        +0x00022408)
#define COMP_COMMON_BASE                (PERIPH_BASE        +0x0002240C)
#define I2CSMB0_BASE                    (PERIPH_BASE        +0x00015800)
#define I2CSMB1_BASE                    (PERIPH_BASE        +0x00015C00)
#define I2CSMB2_BASE                    (PERIPH_BASE        +0x00014C00)
#define I2C0_BASE                       (PERIPH_BASE        +0x00015000)
#define I2C1_BASE                       (PERIPH_BASE        +0x00015400)
#define UART_COMMON_BASE                (PERIPH_BASE        +0x00017C00)
#define UART0_BASE                      (PERIPH_BASE        +0x00011C00)
#define UART1_BASE                      (PERIPH_BASE        +0x00012000)
#define UART2_BASE                      (PERIPH_BASE        +0x00017400)
#define UART3_BASE                      (PERIPH_BASE        +0x00017800)
#define UART4_BASE                      (PERIPH_BASE        +0x00016800)
#define UART5_BASE                      (PERIPH_BASE        +0x00016C00)
#define UART6_BASE                      (PERIPH_BASE        +0x00016000)
#define UART7_BASE                      (PERIPH_BASE        +0x00016400)
#define LPUART0_BASE                    (PERIPH_BASE        +0x00020400)
#define LPUART1_BASE                    (PERIPH_BASE        +0x00020800)
#define SPI0_BASE                       (PERIPH_BASE        +0x00019000)
#define SPI1_BASE                       (PERIPH_BASE        +0x00018C00)
#define SPI2_BASE                       (PERIPH_BASE        +0x00010800)
#define SPI3_BASE                       (PERIPH_BASE        +0x00010400)
#define SPI4_BASE                       (PERIPH_BASE        +0x00010000)
#define EPSC_BASE                       (PERIPH_BASE        +0x00001400)
#define CAN_BASE                        (PERIPH_BASE        +0x00019400)
#define FDCAN_BASE                      (PERIPH_BASE        +0x00019800)
#define DMA_BASE                        (PERIPH_BASE        +0x00000400)
#define CRC_BASE                        (PERIPH_BASE        +0x00018000)
#define ATIM0_BASE                      (PERIPH_BASE        +0x00018400)
#define ATIM1_BASE                      (PERIPH_BASE        +0x0001B000)
#define GPTIM0_BASE                     (PERIPH_BASE        +0x00013800)
#define GPTIM1_BASE                     (PERIPH_BASE        +0x00013C00)
#define GPTIM2_BASE                     (PERIPH_BASE        +0x00014000)
#define BSTIM16_BASE                    (PERIPH_BASE        +0x0001B400)
#define LPTIM16_BASE                    (PERIPH_BASE        +0x00020000)
#define EPWM0_BASE                      (PERIPH_BASE        +0x00011000)
#define EPWM1_BASE                      (PERIPH_BASE        +0x00011100)
#define EPWM2_BASE                      (PERIPH_BASE        +0x00011200)
#define EPWM3_BASE                      (PERIPH_BASE        +0x00011300)
#define RTCB_BASE                       (PERIPH_BASE        +0x0001F000)
#define ADC_BASE                        (PERIPH_BASE        +0x0001AC00)
#define DAC0_BASE                       (PERIPH_BASE        +0x00021800)
#define DAC1_BASE                       (PERIPH_BASE        +0x00021C00)
#define OPA0_BASE                       (PERIPH_BASE        +0x00022800)
#define OPA1_BASE                       (PERIPH_BASE        +0x00022820)
#define PGL_BASE                        (PERIPH_BASE        +0x0001DC00)
#define USBPHY_BASE                     (PERIPH_BASE        +0x10010000)
#define USB_BASE                        (PERIPH_BASE        +0x10011000)
#define GPIOA_BASE                      (PERIPH_BASE        +0x00000C00)
#define GPIOB_BASE                      (PERIPH_BASE        +0x00000C40)
#define GPIOC_BASE                      (PERIPH_BASE        +0x00000C80)
#define GPIOD_BASE                      (PERIPH_BASE        +0x00000CC0)
#define GPIOE_BASE                      (PERIPH_BASE        +0x00000D00)
#define GPIOF_BASE                      (PERIPH_BASE        +0x00000D40)
#define GPIO_COMMON_BASE                       (PERIPH_BASE        +0x00000DC0)
#define SFU_BASE                        (PERIPH_BASE        +0x00002C00)
#define QSPI_BASE                       (PERIPH_BASE        +0xA0044000)

/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */
#define SCU                             ((SCU_Type          *) SCU_BASE         )
#define FLASH                           ((FLASH_Type        *) FLS_BASE       	)
#define PMU                             ((PMU_Type          *) PMU_BASE         )
#define VREFP                           ((VREFP_Type        *) PMU_BASE       	)
#define VAO                             ((VAO_Type          *) VAO_BASE         )
#define CDIF                            ((CDIF_Type         *) CDIF_BASE        )
#define RMU                             ((RMU_Type          *) RMU_BASE         )
#define IWDT                            ((IWDT_Type         *) IWDT_BASE        )
#define WWDT                            ((WWDT_Type         *) WWDT_BASE        )
#define CMU                             ((CMU_Type          *) CMU_BASE         )
#define SVD                             ((SVD_Type          *) SVD_BASE         )
#define AES                             ((AES_Type          *) AES_BASE         )
#define RNG                             ((RNG_Type          *) RNG_BASE         )
#define COMP0                           ((COMP_Type         *) COMP0_BASE)
#define COMP1                           ((COMP_Type         *) COMP1_BASE)
#define COMP2                           ((COMP_Type         *) COMP2_BASE)
#define COMP                            ((COMP_COMMON_Type*) COMP_COMMON_BASE)
#define I2CSMB0                         ((I2CSMB_Type      *) I2CSMB0_BASE     )
#define I2CSMB1                         ((I2CSMB_Type      *) I2CSMB1_BASE     )
#define I2CSMB2                         ((I2CSMB_Type      *) I2CSMB2_BASE     )
#define I2C0                            ((I2C_Type         *) I2C0_BASE        )
#define I2C1                            ((I2C_Type         *) I2C1_BASE        )
#define UART                            ((UART_COMMON_Type         *) UART_COMMON_BASE        )
#define UART0                           ((UART_Type        *) UART0_BASE       )
#define UART1                           ((UART_Type        *) UART1_BASE       )
#define UART2                           ((UART_Type        *) UART2_BASE       )
#define UART3                           ((UART_Type        *) UART3_BASE       )
#define UART4                           ((UART_Type        *) UART4_BASE       )
#define UART5                           ((UART_Type        *) UART5_BASE       )
#define UART6                           ((UART_Type        *) UART6_BASE       )
#define UART7                           ((UART_Type        *) UART7_BASE       )
#define LPUART0                         ((LPUART_Type      *) LPUART0_BASE     )
#define LPUART1                         ((LPUART_Type      *) LPUART1_BASE     )
#define SPI0                            ((SPI_Type         *) SPI0_BASE        )
#define SPI1                            ((SPI_Type         *) SPI1_BASE        )
#define SPI2                            ((SPI_Type         *) SPI2_BASE        )
#define SPI3                            ((SPI_Type         *) SPI3_BASE        )
#define SPI4                            ((SPI_Type         *) SPI4_BASE        )
#define EPSC                            ((EPSC_Type         *) EPSC_BASE        )
#define CAN                             ((CAN_Type          *) CAN_BASE         )
#define FDCAN                           ((FDCAN_Type        *) FDCAN_BASE       )
#define DMA                             ((DMA_Type          *) DMA_BASE         )
#define CRC                             ((CRC_Type          *) CRC_BASE         )
#define ATIM0                           ((ATIM_Type        *) ATIM0_BASE       )
#define ATIM1                           ((ATIM_Type        *) ATIM1_BASE       )
#define GPTIM0                          ((GPTIM_Type       *) GPTIM0_BASE      )
#define GPTIM1                          ((GPTIM_Type       *) GPTIM1_BASE      )
#define GPTIM2                          ((GPTIM_Type       *) GPTIM2_BASE      )
#define BSTIM16                         ((BSTIM16_Type      *) BSTIM16_BASE     )
#define LPTIM16                         ((LPTIM16_Type      *) LPTIM16_BASE     )
#define EPWM0                           ((EPWM_Type        *) EPWM0_BASE       )
#define EPWM1                           ((EPWM_Type        *) EPWM1_BASE       )
#define EPWM2                           ((EPWM_Type        *) EPWM2_BASE       )
#define EPWM3                           ((EPWM_Type        *) EPWM3_BASE       )
#define RTCB                            ((RTCB_Type         *) RTCB_BASE        )
#define ADC                             ((ADC_Type          *) ADC_BASE         )
#define DAC0                            ((DAC_Type         *) DAC0_BASE        )
#define DAC1                            ((DAC_Type         *) DAC1_BASE        )
#define OPA0                            ((OPA_Type         *) OPA0_BASE        )
#define OPA1                            ((OPA_Type         *) OPA1_BASE        )
#define PGL                             ((PGL_Type          *) PGL_BASE         )
#define USBPHY                          ((USBPHY_Type       *) USBPHY_BASE      )
#define USB                             ((USB_Type          *) USB_BASE         )
#define GPIOA                           ((GPIO_Type        *) GPIOA_BASE       )
#define GPIOB                           ((GPIO_Type        *) GPIOB_BASE       )
#define GPIOC                           ((GPIO_Type        *) GPIOC_BASE       )
#define GPIOD                           ((GPIO_Type        *) GPIOD_BASE       )
#define GPIOE                           ((GPIO_Type        *) GPIOE_BASE       )
#define GPIOF                           ((GPIO_Type        *) GPIOF_BASE       )
#define GPIO                            ((GPIO_COMMON_Type  *) GPIO_COMMON_BASE )
#define SFU                             ((SFU_Type          *) SFU_BASE         )
#define QSPI                            ((QSPI_Type         *) QSPI_BASE        )

/* ================================================================================ */
/* ================             Peripheral include                 ================ */
/* ================================================================================ */

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group FM33FKXX */
/** @} */ /* End of group Keil */

#ifdef __cplusplus
}
#endif

#endif  /* FM33FK5XX_H */

